// 数値の計算をしてみましょう！
console.log(6 + 3);

// 同じ「6 + 3」でも、シングルクォーテーションをつけて「文字列」として出力すると・・・？
console.log("6 + 3");

// 文字列も、足し算することができます。その場合の結果は・・・？
console.log("このプログラムは" + "JavaScriptです。");

// 「6」と「3」を文字列として足し算すると・・・？
console.log("6" + "3");

// ☆ この下で、実際に計算をしてみましょう。console.log()の中で、
// 今の西暦(2022)からあなたの年齢を引いて、その結果を出力してください。
// 結果の数値があなたの生まれた年になっていれば、コーディングは成功です！
console.log(2024 - 1996);

// いろんな演算子を試してみましょう！
console.log(10 - 3); // 引き算の演算子「-」
console.log(10 * 3); // 掛け算の演算子「*」
console.log(10 / 3); // 割り算の演算子「/」
console.log(10 % 3); // 剰余（整数の割り算のあまりの数）の演算子「%」
